
/********************************************************************************

注：凡是YXTouchLib开头的宏定义，用户可以根据实际调试需要，修改后面的数据

*******************************************************************************/
#ifndef __YX23F01CB_GeneralKey_Touch_Filter_H__
#define __YX23F01CB_GeneralKey_Touch_Filter_H__


/****************************************************************************************************/
void TouchRawDataFilter(void);		//触摸RawData滤波函数，此函数必须添加在main.c中，否则程序无法正常运行
/****************************************************************************************************/

// 设置RawData滤波深度，打开后系统会对RawData采用递推中位值平均滤波，即对递推数组进行排序后去除最高值和最低值，然后对剩余数据计算平均值
//			0：关闭滤波功能
//			3->15：设置滤波数组长度，如设置为5，则对RawData数据进行排序，然后去除最高值和最低值，剩余的3个数据计算平均得到最终值
#define YXTouchLib_FILTER_DEPTH					0
/****************************************************************************************************/

#endif

/******************************************************************************************************

 ******************************************************************************************************/